#ifndef __LASAL32_H__
#define __LASAL32_H__


// ++WCE CHANGED START
#define DLL_NAME       _T("LASAL32.DLL")   // DLL-Name
// ++WCE CHANGED END

#ifdef BUILD_LASAL32
	#include "BuildNumber.h"
#endif 

/////////////////////////////////////////////////////////////////////////
// Version braucht in der Version Resource nicht mehr angepasst werden, nur noch hier 2mal.
#define LASAL32_VERSION_MAJOR			1
#define LASAL32_VERSION_MINOR			1
#define LASAL32_VERSION_SUBVERSION		134
#define LASAL32_VERSION_TXT				"01.01.134"
// LASAL32_VERSION_TXT sollte mal automatisch generiert werden.

// Für zukünftigen Build Counter vom Build Rechner
#ifdef CC_BUILD_NUMBER
	#define LASAL32_VERSION_BUILD			CC_BUILD_NUMBER_NR
	#define LASAL32_VERSION_BUILD_TXT		CC_BUILD_NUMBER
#else
	#define LASAL32_VERSION_BUILD			0
	#define LASAL32_VERSION_BUILD_TXT		"dev"
#endif

// aktuelle DLL-Version
#define LASAL32_VERSION		((LASAL32_VERSION_MAJOR << 12) | (LASAL32_VERSION_MINOR << 8) | LASAL32_VERSION_SUBVERSION)

// Wegen Kompatibilität wird DLL_VERSION noch gebraucht.
#define DLL_VERSION			LASAL32_VERSION

//#define TESTVERSION
#undef TESTVERSION

//#################################################################################
// ACHTUNG:
//   neue Funktionen sollten mit Lsl.. beginnen.
//#################################################################################

///////////////////////////////////////////////////////////////////////////////////
// Versionsübersicht

//                            DBGMAX:   max. Anzahl von Debugmeldungen, um die Platte, auf der
//                                      sich das Debugfile befindet nicht voll zu machen
//                                    (Default: 100000)
//                        Über ein Preprozessor define (DEBUGLOG - File debug.h) kann der Code
//                        für diese Meldungen aktiviert od. deaktiviert werden.
//                     - CAN-Funktionen tlw.aktiviert. 
//                          Für die Nutzung dieser Funktionen ist der CANLPT-Treiber erforderlich !

// 0x0110 (09.11.01):  - ???

// 0x010F (21.08.01):  - callback-funktion beim Moduldownload, deleteModule

// 0x010E (23.07.01):  THR: Added the following changes (search for V010E
//                     - V24.cpp: Created defines for Tx and Rx maximum buffer sizes and
//                       increased to 1024 bytes each.  All single calls to SendComm
//                       or ReadComm MUST transfer less than these amounts.  This is
//                       some large file transfers were failing.
//                     - V24.cpp: Modified SetupComm() call to use new definess.
//                     - V24.cpp: Added new V24BootOSFile() function to boot from a file.
//                     - V24.cpp: Added new V24LoadFilePacket() function and modified the
//                       V24LoadFile() function to retry block reads up to 3 times.
//                     - V24.h: Added prototype for V24BootOSFile() function.
//                     - lasal32.cpp, lasal32.h, lasal32.exp: Added LslBootOSFile()
//                       export function.

// 0x010D (20.06.01):  - GetLinkerError, StoreFile,..

// 0x010C (17.04.00):  - Modem Kommunikation optimiert
//                     - CPU Auslastung unter NT verringert
// 0x010B (19.01.00):  - DetectDMx(), ReadDMx(), WriteDMx(), EraseDmx() eingebaut

// 0x010A (10.01.00):  - Fehler im SYS-Treiber behoben (Fehler unter NT im Softmodus)

// 0x0109 (21.12.99):  - Fehler bei CAN-Betrieb unter NT behoben
//                     - Endlosschleife bei OFFLINE über V24 unter NT

// 0x0108 (02.11.99):  - MODEM-Funktion für Windows NT erweitert und getestet

// 0x0107 (07.02.99):  - MODEM-Funktion eingebaut (direkt und Modemprozessor)

// 0x0106 (08.12.98):  - TCP/IP Unterstützung
//                     - GetCpuStatus2() für die PG50 eingebaut

// 0x0105 (27.04.98):  - Probleme beim Oeffnen des SYS-Treibers behoben
//                     - im VXD wird die LPT-Portadresse aus dem BIOS bestimmt

// 0x0104 (24.03.98):  - SetRegister(): erweiterte Register beginnen bei 13 statt 12
//                     - V24SetKopBp() korrigiert

// 0x0103 (18.03.98):  - GetCpuStatus() funktioniert auch wenn es der erste V24-Zugriff ist.

// 0x0102 (17.03.98):  - bei Win95 "harter" Modus fuer PG-Statustest


// Das #define LASAL32_STATIC_LIB muß definiert werden, wenn die DLL als statisch 
// gelinkte Bibliothek eingebunden wird.

typedef int32_t					LSL_BOOL;				//
typedef void *					LSL_HANDLE;				// 

#pragma pack(push, 1)
typedef struct _LSL_SYSTEMTIME
{
	uint16_t wYear;
	uint16_t wMonth;
	uint16_t wDayOfWeek;
	uint16_t wDay;
	uint16_t wHour;
	uint16_t wMinute;
	uint16_t wSecond;
	uint16_t wMilliseconds;
} LSL_SYSTEMTIME;
#pragma pack(pop)


#if defined(LASAL32_STATIC_LIB) || defined(COMPILE_LINUX)
#define LASAL32_EXPORTS
#else
#define LASAL32_EXPORTS WINAPI
#endif


////////////////////////////////////////////////////////////////////////////////
//
// Error-codes from GetLastError
//
////////////////////////////////////////////////////////////////////////////////

#define ERROR_SIGMA32_NO						0				// Kein Fehler
#define ERROR_SIGMA32_ACCESSDENIED				0x20000001L		// Der Treiber wird bereits von einer anderen Software verwendet (z.B.: PG)
#define ERROR_SIGMA32_NOTOPEN					0x20000002L		// Es wurde eine DLL-Funktion aufgerufen, ohne vorher die Kommunikation mit Online() zu initialisieren.
#define ERROR_SIGMA32_ALREADYOPEN				0x20000003L		// Online() wurde noch einmal aufgerufen, ohne die Kommunikation mit Offline() zu beenden.
#define ERROR_SIGMA32_NOTDEFINEDFORV24			0x20000004L		// Es wurde eine CAN-Funktion waehrend der V24-Kommunikation aufgerufen.
#define ERROR_SIGMA32_WRONGPARAMETER			0x20000005L		// Ungueltige Parameter beim Aufruf der letzten Funktion
#define ERROR_SIGMA32_WRITE_TIMEOUT				0x20000006L		// Timeout-Fehler waehrend dem Senden
#define ERROR_SIGMA32_READ_TIMEOUT				0x20000007L		// Timeout-Fehler waehrend dem Empfangen
#define ERROR_SIGMA32_WRITE_FAULT				0x20000008L		// Allgemeiner Fehler beim Senden
#define ERROR_SIGMA32_READ_FAULT				0x20000009L		// Allgemeiner Fehler beim Empfangen
#define ERROR_SIGMA32_CONN_RESET				0x2000000CL		// Online wurde zwar aufgerufen, es besteht inzwischen aber keine Verbindung mehr
#define ERROR_SIGMA32_ABORTED_BY_USER			0x2000000DL		// Callback Funktion hat einen Abbruch verlangt
#define ERROR_SIGMA32_REMOTE_ERROR				0x2000000EL		// Von der Gegenstation wurde ein Fehler angezeigt
#define ERROR_SIGMA32_UNSUPPORTED_CMD			0x2000000FL		// Befehl wird von der Gegenstation nicht unterstützt
#define ERROR_SIGMA32_GENERAL_ERROR				0x20000010L		// unbekannter allgemeiner Fehler
#define ERROR_SIGMA32_CONNECT_FAILED			0x20000011L		// Verbindungsaufbau hat fehlgeschlagen
#define ERROR_SIGMA32_INVALID_FUNCTION			0x20000012L		// Invalid function
#define ERROR_SIGMA32_CPUSTATUS_TIMEOUT			0x20000013L		// Timeout waiting for a specific CPU status
#define ERROR_SIGMA32_OUT_OF_MEM				0x20000014L		// Out of memory
#define ERROR_SIGMA32_MAX_CONN					0x20000015L		// max. Nbr. of connections reached
#define ERROR_SIGMA32_INV_OCB_NBR				0x20000016L		// invalid ocb number
#define ERROR_SIGMA32_INV_PRJ_STATE				0x20000017L		// invalid project state
#define ERROR_SIGMA32_OUT_OF_BUFSIZE			0x20000018L		// Buffer size is too small
#define ERROR_SIGMA32_INVALID_DATA				0x20000019L		// Invalid data for Single Object File
#define ERROR_SIGMA32_INVALID_RLB				0x2000001AL		// Wrong RLB id
#define ERROR_SIGMA32_LENGTH_TO_BIG				0x2000001BL		// Length is to big
#define ERROR_SIGMA32_WRONG_VAR_TYPE			0x2000001CL		// Wrong Variable Type
#define ERROR_SIGMA32_LENGTH_WRONG				0x2000001DL		// Length is wrong
#define ERROR_SIGMA32_INIT_SYMTAB				0x2000001EL		// Call InitSymTab faild
#define ERROR_SIGMA32_TX_COMMAND				0x2000001FL		// TxCommand failed
#define ERROR_SIGMA32_NOT_READY					0x20000020L		// TxCommand returned NOT Ready
#define ERROR_SIGMA32_INVALID_ADDRESS			0x20000021L		// The address is invalid
#define ERROR_SIGMA32_WRONG_CONNECTION_TYPE		0x20000022L		// Wrong Connection (Bus ) Type
#define ERROR_SIGMA32_NO_FREE_DOB				0x20000023L		// no free DOB (DirectOnlineBlock)
#define ERROR_SIGMA32_WRONG_DOB					0x20000024L		// wrong DOB id
#define ERROR_SIGMA32_NO_DOB					0x20000025L		// no DOB for id found
#define ERROR_SIGMA32_CONNECTION_ABORTED		0x20000026L		// Connection Aborted
#define ERROR_SIGMA32_WRONG_RECEIVE_MODE		0x20000027L		// 
#define ERROR_SIGMA32_DO_RECEIVE_NO_DATA		0x20000028L		// No Data for Receive available
#define ERROR_SIGMA32_DO_RECEIVE_TIMEOUT		0x20000029L		// No Data for Receive available
#define ERROR_SIGMA32_DO_UNKNOWN_SET			0x2000002AL		// Unknown DirectOnline Set Type
#define ERROR_SIGMA32_ERROR_STATUS				0x2000002BL		// The correct error are in a other parameter
#define ERROR_SIGMA32_FILE_OPEN					0x2000002CL		// error at open a file
#define ERROR_SIGMA32_FILE_READ					0x2000002DL		// error reading a file
#define ERROR_SIGMA32_FILE_WRITE				0x2000002EL		// error writting a file
#define ERROR_SIGMA32_FILE_CLOSE				0x2000002FL		// error close a file
#define ERROR_SIGMA32_FILE_HANDLE				0x20000030L		// error invalid file handle
#define ERROR_SIGMA32_FILE_SEEK					0x20000031L		// error seek
#define ERROR_SIGMA32_FILE_TELL					0x20000032L		// error tell
#define ERROR_SIGMA32_FILE_SETSIZE				0x20000033L		// error set file size
#define ERROR_SIGMA32_FILE_GETATTRIBUTE			0x20000034L		// error set file attribute
#define ERROR_SIGMA32_FILE_SETATTRIBUTE			0x20000035L		// error set file attribute
#define ERROR_SIGMA32_FILE_SETDATETIME			0x20000036L		// error set file file date/time
#define ERROR_SIGMA32_FILE_NOT_FOUND			0x20000037L		// error find not found
#define ERROR_SIGMA32_WRONG_ONLINE_PWD			0x20000038L		// wrong online pwd
#define ERROR_SIGMA32_NO_SUPPORT_BY_OS_VER		0x20000039L		// Functionality not supported by this OS version
#define ERROR_SIGMA32_NO_PASSWORD_SET			0x20000040L		// If one trys to go online with a password but there 
																// is no password protection on the target the Online command will succeed, but the 
#define ERROR_SIGMA32_CONNCLOSED				0x20000041L		// connection is closed
#define ERROR_SIGMA32_READONLY					0x20000042L		// 
#define ERROR_SIGMA32_SOCKET_ALREADYOPEN		0x20000043L		// socket is already open 
#define ERROR_SIGMA32_SOCKET_INVALID			0x20000044L		// invalid socket

////////////////////////////////////////////////////////////////////////////////
//
// VARAN32.DLL
//
//	needed defines for Varan32.dll using.
////////////////////////////////////////////////////////////////////////////////
#define VARAN32_WFTE_STATE_BUSY		4 //auch in Varan32.h ändern!
#define VARAN32_WFTE_STATE_FINISH	5 //auch in Varan32.h ändern!
#define VARAN32_CONNECTION_STRING   "VARAN32:"

////////////////////////////////////////////////////////////////////////////////
//
// File attributes
//
////////////////////////////////////////////////////////////////////////////////

#define LSL32_ATTR_READ_ONLY      0x0001
#define LSL32_ATTR_HIDDEN         0x0002
#define LSL32_ATTR_SYSTEM         0x0004
#define LSL32_ATTR_VOLUME         0x0008
#define LSL32_ATTR_DIR            0x0010
#define LSL32_ATTR_ARCHIVE        0x0020

#define LSL32_DELETE_FILE            0
#define LSL32_REMOVE_DIR             1

////////////////////////////////////////////////////////////////////////////////
//
// Error-codes from LasalOS
//
////////////////////////////////////////////////////////////////////////////////
#define LSLOS_ERROR_GENERAL                     0xA0008013L			// General Error, not really specified
#define LSLOS_FILE_ERROR_GENERAL                0xA0010000L			// General File Error, not really specified
#define LSLOS_ERROR_INVALID_FILENAME            0xA0018003L			// The filename, directory name, or volume label syntax is incorrect.
#define LSLOS_ERROR_DRIVE_NOT_FOUND             0xA0018004L			// The system cannot find the drive specified.
#define LSLOS_ERROR_FILE_NOT_FOUND              0xA0018009L			// The system cannot find the file specified.
#define LSLOS_ERROR_ACCESS_DENIED               0xA0018010L			// Access is denied.
#define LSLOS_ERROR_PATH_NOT_FOUND              0xA0018013L			// The system cannot find the path specified.
#define LSLOS_ERROR_DISK_FULL                   0xA0018016L			// There is not enough space on the disk.
#define LSLOS_ERROR_MEDIA_CHANGED               0xA001801AL			// The media in the drive may have changed.
#define LSLOS_ERROR_NOT_READY                   0xA001801DL			// The device is not ready.
#define LSLOS_ERROR_WRITE_PROTECT               0xA001801EL			// The media is write protected.
#define LSLOS_ERROR_SYSTEM_OS					0xA0019000			// Base for OS (Salamander) Error

// Routing
#define LASAL32_ADDROUTETIMEOUT                 500000  // This additional timeout is valid for routed communication [ms]
                                                        // The Echo Request Command does not use this (for measurement!)
#define LASAL32_MAXHOPS 10

//Traceroute Interfacetypes
#define LASAL32_INTERFACETYPE_TCP 0
#define LASAL32_INTERFACETYPE_CAN 1
#define LASAL32_INTERFACETYPE_LOOP 2
#define LASAL32_INTERFACETYPE_ROOT 3
#define LASAL32_INTERFACETYPE_UNKNOWN 255

#pragma pack(push, 1)
typedef struct 
{
  uint8_t station;
  uint8_t hop;
  uint8_t type;
  uint8_t state;
  uint32_t time;
} LSL32_T_TRACERECORD;




// Format

typedef struct
{
  char DeviceName[32];

#define LSL32_FORMAT_PROGRESS_READY   0   // READY, ready to format the drive
#define LSL32_FORMAT_PROGRESS_BUSY    1   // BUSY,  format in progress
#define LSL32_FORMAT_PROGRESS_DONE    2   // DONE,  format finished successfully
#define LSL32_FORMAT_PROGRESS_ERROR   3   // ERROR, format finished not successfull

  uint32_t Total;
  uint32_t Completed;
  uint32_t Status;

} LSL32_FORMAT_PROGRESS_INFO;

typedef int32_t __cdecl CB_FORMAT_FUNCTYPE(LSL32_FORMAT_PROGRESS_INFO * pFormatProgressInfo);

// CheckDisk
#define LSL32_CHKDSK_OPTION_CORRECT   0x01

typedef int32_t __cdecl CB_CHKDSK_FUNCTYPE(char * strProgressInfo, uint32_t ProgressInfoLen);


// DriveList

// DriveList Options
#define DRIVELIST_OPT_MOUNTED         0x01
#define DRIVELIST_OPT_MOUNTSTATE      0x02
#define DRIVELIST_OPT_TYPE            0x04
#define DRIVELIST_OPT_DRIVER          0x08

// General Info (Type, Mounted?)
#define DRIVELIST_FLOPPY              0x00000001    // 00000000 00000000 00000000 00000001
#define DRIVELIST_FDISK               0x00000002    // 00000000 00000000 00000000 00000010
#define DRIVELIST_MOUNTED             0x00000004    // 00000000 00000000 00000000 00000100

#define DRIVELIST_GI_MASK             0x00000007    // 00000000 00000000 00000000 00000111

// Mountstate
#define DRIVELIST_MS_INITIALIZED      0x00000100    // 00000000 00000000 00000001 00000000
#define DRIVELIST_MS_MOUNTED          0x00000200    // 00000000 00000000 00000010 00000000
#define DRIVELIST_MS_ACCESSIBLE       0x00000400    // 00000000 00000000 00000100 00000000
#define DRIVELIST_MS_HASFILESYSTEM    0x00000800    // 00000000 00000000 00001000 00000000

#define DRIVELIST_MS_MASK             0x00000F00    // 00000000 00000000 00001111 00000000

// Driver
#define DRIVELIST_DRV_FLOPPY          0x00010000    // 00000000 00000001 00000000 00000000
#define DRIVELIST_DRV_IDE             0x00020000    // 00000000 00000010 00000000 00000000
#define DRIVELIST_DRV_USB             0x00030000    // 00000000 00000011 00000000 00000000
#define DRIVELIST_DRV_CME221          0x00040000    // 00000000 00000100 00000000 00000000
#define DRIVELIST_DRV_SMARTMEDIA      0x00050000    // 00000000 00000101 00000000 00000000
#define DRIVELIST_DRV_UDRAM           0x00060000    // 00000000 00000110 00000000 00000000

#define DRIVELIST_DRIVER_MASK         0x00070000    // 00000000 00000111 00000000 00000000

//==========================================================================================
// previous CpRegs.h
//==========================================================================================


// LASAL - Debug - API
// CPU Registers
typedef struct CP_REG
{
   uint32_t rEDI;  // 12
   uint32_t rESI;  // 16
   uint32_t rEBP;  // 20
   uint32_t rESP;  // 24
   uint32_t rEBX;  // 16
   uint32_t rEDX;  // 20
   uint32_t rECX;  // 24
   uint32_t rEAX;  // 28
   uint32_t rEIP;  // 00
   uint32_t  rCS;  // 04
   uint32_t rEFL;  // 08
   uint32_t  rSS;  // 44
   uint32_t  rGS;  // 48
   uint32_t  rFS;  // 52
   uint32_t  rES;  // 56
   uint32_t  rDS;  // 60
}CP_REG;

// LASAL - Debug - API
// CPU Registers new
typedef struct CP_REGextend
{
   uint32_t rEDI;  // 12
   uint32_t rESI;  // 16
   uint32_t rEBP;  // 20
   uint32_t rESP;  // 24
   uint32_t rEBX;  // 16
   uint32_t rEDX;  // 20
   uint32_t rECX;  // 24
   uint32_t rEAX;  // 28
   uint32_t rEIP;  // 00
   uint32_t  rCS;  // 04
   uint32_t rEFL;  // 08
   uint32_t  rSS;  // 44
   uint32_t  rGS;  // 48
   uint32_t  rFS;  // 52
   uint32_t  rES;  // 56
   uint32_t  rDS;  // 60
	 uint32_t rEIPr;  // 64 realtiv to modul
	 uint32_t mID;    // 68 modul ID 
}CP_REGextend;

typedef struct ExPrjStatus
{
    char MsgCounter;
    char Dummy1;
    char Dummy2;
    char Dummy3;
}ExPrjStatus;

// LASAL - Debug - API
// Project info 
typedef struct PrjHeader
{
   uint32_t Prjchk; 
   uint32_t ModEnabled;
   ExPrjStatus Status;
   char  PrjName[64];
}PrjHeader;


// LASAL - Debug - API
// Modul info 
typedef struct ModHeader
{
   uint32_t ID; 
   uint32_t ModChk;
   uint32_t ModStart; 
}ModHeader;

typedef struct ModHeaderReq
{
  uint32_t Id;
  uint8_t Enable;
}ModHeaderReq;

/* Wu 25.04.2012	Rauskommentiert da es im Code nicht mehr verwendet wird 
falls es noch gebraucht wird Wu bescheidgeben. An sonsten wird es in den zukünftigen Versionen eleminiert
typedef struct BpLst
{
	uint32_t PRGoffset1;
	uint32_t PRGoffset2;
	uint32_t PRGoffset3;
	uint32_t PRGoffset4;
	uint32_t Status;
	uint32_t Control;
	uint32_t ModulID1;
	uint32_t Offset1;
 	uint32_t ModulID2;
	uint32_t Offset2;	
	uint32_t ModulID3;
	uint32_t Offset3;	
	uint32_t ModulID4;
	uint32_t Offset4;	
}BpLst;
*/


// LASAL - Debug - API
// Awl Breakpoint info 
typedef struct AWLBPINFO
{
	CP_REGextend CpRegEx;	// Cpu Register
	uint32_t	     StackLen;	// Größe des nachfolgenden Arrays
	uint8_t	     Stack[1];	// variables Array (Größe = StackLen)
} AWLBPINFO;

typedef struct BPEXTEND_SET_TYPE
{
  uint16_t sizeofheader;  // Größe der Struktur (ohne nachfolgenden Code)
  uint8_t  bpnum;          // Breakpoint Nr.
  uint32_t modid;          // Modul Nr.
  uint32_t offset;         // Breakpoint Adresse
  uint8_t  tobp;           // Type of Breakpoint
  int32_t  stackoffset;    // Offset des Stackbereichs (bezogen auf Basepointer)
  uint32_t stacksize;      // Größe des Stackbereichs, den das Lasal-OS zwischenspeichert
  uint32_t counter;        // Counter, nach wievielen Durchläufen angehalten wird
  uint32_t codelength;     // Länge des Codes (für bed.Bp), der auf diese Struktur folgt
}BPEXTEND_SET_TYPE;

typedef struct BPEXTEND_SET_TYPE_V2
{
  uint16_t sizeofheader;  // Größe der Struktur (ohne nachfolgenden Code)
  uint8_t  bpnum;          // Breakpoint Nr.
  uint32_t modid;          // Modul Nr.
  uint32_t offset;         // Breakpoint Adresse
  uint8_t  tobp;           // Type of Breakpoint
  int32_t  stackoffset;    // Offset des Stackbereichs (bezogen auf Basepointer)
  uint32_t stacksize;      // Größe des Stackbereichs, den das Lasal-OS zwischenspeichert
  uint32_t counter;        // Counter, nach wievielen Durchläufen angehalten wird
  uint32_t codelength;     // Länge des Codes (für bed.Bp), der auf diese Struktur folgt
  uint8_t  lenx;           // Länge der Adresse (Datenbreakpoint) .. ab OS 5.22
}BPEXTEND_SET_TYPE_V2;

typedef struct BPEXTEND_SET_TYPE_V3
{
  uint16_t sizeofheader;  // Größe der Struktur (ohne nachfolgenden Code)
  uint8_t  bpnum;          // Breakpoint Nr.
  uint8_t  tobp;           // Type of Breakpoint
  uint32_t modid;          // Modul Nr.
  uint32_t offset;         // Breakpoint Adresse
  int32_t  stackoffset;    // Offset des Stackbereichs (bezogen auf Basepointer)
  uint32_t stacksize;      // Größe des Stackbereichs, den das Lasal-OS zwischenspeichert
  uint32_t counter;        // Counter, nach wievielen Durchläufen angehalten wird
  uint32_t codelength;     // Länge des Codes (für bed.Bp), der auf diese Struktur folgt
  uint8_t  lenx;           // Länge der Adresse (Datenbreakpoint) .. ab OS 5.22
  uint32_t action;         // ab V3 (1.1.79)
}BPEXTEND_SET_TYPE_V3;

typedef struct BPEXTEND_GET_INFO
{
  uint16_t sizeofheader;  // Größe der Struktur
  uint8_t bpnum;          // Breakpoint Nummer (0..3)
  uint8_t tobp;           // 76543210
                                // ......xx :  00=Instruction Breakpoint
                                //             01=Instruction Breakpoint AWL
                                //             10=Datenbreakpoint Read
                                //             11=Datenbreakpoint Read+Write
                                // ...xxx...:  res. (000)
                                // ..x..... :  1=Stack für AWL-Breakpoint vorhanden
                                // .x...... :  1=Code für bedingten Breakpoint vorhanden
                                // x....... :  0=Breakpoint nicht gesetzt
                                //          :  1=Breakpoint gesetzt
  union {
    struct {                    // Instruction Breakpoint:
      uint32_t modulid;    //  Modul-ID
      uint32_t modulofs;   //  Breakpoint Adresse - Offset im Modul
    };
    struct {                    // Daten Breakpoint
      uint32_t addr;       //  Adresse des Datenbreakpoints
      uint8_t len;        //  Länge des Datenbreakpoints
    };
  };
  uint32_t counter;        // aktueller Counter (verbleibende Anzahl von Durchläufen, bis Breakpoint aktiviert wird)
  uint32_t stacklength;    // Größe des Stacks beim AWL-Breakpoint
  int32_t  stackoffset;    // Stackoffset beim AWL-Breakpoint
  uint32_t codecrc32;      // Checksum des Codes für bedingten Breakpoint
}BPEXTEND_GET_INFO;
  
typedef struct BPEXTEND_GET_INFO_SINGLE
{
  uint8_t tobp;           // 76543210
                                // ......xx :  00=Instruction Breakpoint
                                //             01=Instruction Breakpoint AWL
                                //             10=Datenbreakpoint Read
                                //             11=Datenbreakpoint Read+Write
                                // ...xxx...:  res. (000)
                                // ..x..... :  1=Stack für AWL-Breakpoint vorhanden
                                // .x...... :  1=Code für bedingten Breakpoint vorhanden
                                // x....... :  0=Breakpoint nicht gesetzt
                                //          :  1=Breakpoint gesetzt
  union {
    struct {                    // Instruction Breakpoint:
      uint32_t modulid;    //  Modul-ID
      uint32_t modulofs;   //  Breakpoint Adresse - Offset im Modul
    };
    struct {                    // Daten Breakpoint
      uint32_t addr;       //  Adresse des Datenbreakpoints
      uint8_t len;        //  Länge des Datenbreakpoints
    };
  };
  uint32_t counter;        // aktueller Counter (verbleibende Anzahl von Durchläufen, bis Breakpoint aktiviert wird)
  uint32_t stacklength;    // Größe des Stacks beim AWL-Breakpoint
  int32_t  stackoffset;    // Stackoffset beim AWL-Breakpoint
  uint32_t codecrc32;      // Checksum des Codes für bedingten Breakpoint
}BPEXTEND_GET_INFO_SINGLE;


//==========================================================================================
// Comlink Definitionen
//==========================================================================================

typedef struct ComRegData
{
  uint32_t   LASALID;   // the identifier you get at I_GETOBJ
  uint16_t channel;   // nobody is using this 
  uint16_t VarPos;    // position 
  uint16_t uiTIME;    // updatetime in ms
  uint32_t   VarlistID; // from LSE a number give back at callback (not interpreted)
}ComRegData;                // you can write a value you want  

typedef struct RESULTS
{
    uint16_t uiLng;
    uint8_t aData[256]; 
}RESULTS;

typedef struct _D2LSE
{ 
	uint32_t varlistID;
	int16_t uiOffs;
	int32_t Data;
} D2LSE;

typedef struct SRegisterI386
{
	uint32_t rEDI;  // 12
	uint32_t rESI;  // 16
	uint32_t rEBP;  // 20
	uint32_t rESP;  // 24
	uint32_t rEBX;  // 16
	uint32_t rEDX;  // 20
	uint32_t rECX;  // 24
	uint32_t rEAX;  // 28
	uint32_t rEIP;  // 00
	uint32_t  rCS;  // 04
	uint32_t rEFL;  // 08
	uint32_t  rSS;  // 44
	uint32_t  rGS;  // 48
	uint32_t  rFS;  // 52
	uint32_t  rES;  // 56
	uint32_t  rDS;  // 60
} SRegisterI386;

typedef struct SRegisterI386Float
{
	SRegisterI386 standardRegs;
	uint32_t dFloat[8][2];	// 8 * 8Byte
	uint16_t ctrl;
	uint16_t stat;
	uint16_t tags;
	uint16_t dummy;
} SRegisterI386Float;

typedef struct SRegisterPPC
{
	uint32_t r[32];
	uint32_t pc;
	uint32_t msr;
	uint32_t cr;
	uint32_t xer;
	uint32_t ctr;
	uint32_t lr;
} SRegisterPPC;

typedef struct SRegisterPPCFloat
{
  SRegisterPPC standardRegs;
	uint32_t f[32][2];
} SRegisterPPCFloat;

typedef struct SRegisterARM
{
  uint32_t R0;  // 12
  uint32_t R1;  // 16
  uint32_t R2;  // 20
  uint32_t R3;  // 24
  uint32_t R4;  // 16
  uint32_t R5;  // 20
  uint32_t R6;  // 24
  uint32_t R7;  // 28
  uint32_t R8;  // 00
  uint32_t R9;  // 04
  uint32_t R10;  // 08
  uint32_t R11;  // 44
  uint32_t R12;  // 48
  uint32_t SP;  // 52
  uint32_t LR;  // 56
  uint32_t PC;  // 60
  uint32_t CPSR;
  uint32_t SPSR;
} SRegisterARM;

typedef struct SRegisterARMFloat
{
  SRegisterARM standardRegs;
    uint32_t f[32];
    uint32_t fpsid;
    uint32_t fpscr;
    uint32_t fpexc;
} SRegisterARMFloat;


typedef struct SRegisterCPU
{
  uint32_t lWasHabIchBekommenFlag;
  uint32_t lRelativeIP;
  uint32_t lModuleIP;

  union 
  {
    SRegisterI386 cpu386;
    SRegisterI386Float cpu386Float;
    SRegisterPPC cpuPPC;
    SRegisterPPCFloat cpuPPCFloat;
    SRegisterARM cpuARM;
    SRegisterARMFloat cpuARMFloat;
  };
} SRegisterCPU;

typedef struct CP_REGextendPPC
{
  SRegisterPPC standardRegs;
  uint32_t rEIPr;  // realtiv to modul
  uint32_t mID;    // modul ID 
} CP_REGextendPPC;

typedef struct CP_REGextendARM
{
  SRegisterARM standardRegs;
  uint32_t rEIPr;  // realtiv to modul
  uint32_t mID;    // modul ID 
} CP_REGextendARM;

typedef struct AWLBPINFOPPC
{
  CP_REGextendPPC CpRegEx;
  uint32_t           StackLen;
  uint8_t            Stack[ 1 ];
